# PAGE_NAME으로 바로 호출 가능하도록 0번째 값을 비워줌
testcase_and_result = [
    {"que_number": 0, "lv": "", "kinds": "", "testcase": "", "result": ""},
    {
        "que_number": 1,
        "lv": 0,
        "kinds": "요구사항 구현",
        "testcase": [
            [1, 2, 3, 4, 5],
            [],
            [1, 3, 5, 7, 9],
            [2, 3, 4],
            [2, 4, 6, 8],
        ],
        "result": [9, 0, 25, 3, 0],
    },
    {
        "que_number": 2,
        "lv": 0,
        "kinds": "요구사항 구현",
        "testcase": [
            [1, 2, 3, 4, 5],
            [],
            [1, 3, 5, 7],
            [2, 3, 4],
            [2, 4, 6, 8],
        ],
        "result": [120, 0, 105, 24, 384],
    },
    {
        "que_number": 3,
        "lv": 0,
        "kinds": "요구사항 구현",
        "testcase": [
            [1, 2, 3, 4, 5],
            [],
            [1, 3, 5, 7],
            [2, 3, 4],
            [2, 4, 6, 8],
        ],
        "result": [7, 0, 8, 6, 14],
    },
    {
        "que_number": 4,
        "lv": 0,
        "kinds": "요구사항 구현",
        "testcase": [
            ["쿠키 1개", "쿠키 2개", "쿠키 3개"],
            ["쿠키 2개", "쿠키 2개", "쿠키 3개"],
            ["쿠키 3개", "쿠키 3개", "쿠키 3개"],
            ["쿠키 3개", "쿠키 2개", "쿠키 5개"],
            ["쿠키 1개", "쿠키 1개", "쿠키 1개"],
        ],
        "result": [14, 15, 18, 22, 6],
    },
]
